{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"cmake_minimum_required":12,"version":13,"26":14,"when":15,"building":16,"directly":17,"using":18,"cmake":19,"make":20,"sure":21,"run":22,"install":23,"step":24,"places":25,"so":26,"files":27,"correct":28,"location":29,"example":30,"mkdir":31,"build":32,"cd":33,"ninja":34,"dvllm_python_executable":35,"which":36,"python3":37,"dcmake_install_prefix":38,"target":39,"want":40,"only":41,"one":42,"manually":43,"_c":44,"component":45,"project":46,"vllm_extensions":47,"languages":48,"cxx":49,"cuda":50,"default":51,"can":52,"overridden":53,"dvllm_target_device":54,"used":55,"setup":56,"py":57,"set":58,"vllm_target_device":59,"cache":60,"string":61,"device":62,"backend":63,"message":64,"status":65,"type":66,"cmake_build_type":67,"include":68,"cmake_current_list_dir":69,"utils":70,"suppress":71,"potential":72,"warnings":73,"unused":74,"specified":75,"variables":76,"ignoreme":77,"vllm_python_path":78,"prevent":79,"installation":80,"dependencies":81,"cutlass":82,"code":83,"cmake_install_local_only":84,"true":85,"all_components":86,"supported":87,"python":88,"versions":89,"searched":90,"order":91,"first":92,"match":93,"selected":94,"should":95,"kept":96,"sync":97,"python_supported_versions":98,"10":99,"11":100,"12":101,"amd":102,"gpu":103,"architectures":104,"hip_supported_archs":105,"gfx906":106,"gfx908":107,"gfx90a":108,"gfx942":109,"gfx950":110,"gfx1030":111,"gfx1100":112,"gfx1101":113,"gfx1200":114,"gfx1201":115,"expected":116,"torch":117,"rocm":118,"currently":119,"having":120,"incorrect":121,"pytorch":122,"results":123,"warning":124,"rather":125,"than":126,"error":127,"note":128,"derived":129,"from":130,"pyproject":131,"toml":132,"various":133,"requirements":134,"txt":135,"consistent":136,"docker":137,"dockerfile":138,"torch_supported_version_cuda":139,"torch_supported_version_rocm":140,"try":141,"package":142,"executable":143,"exactly":144,"matches":145,"vllm_python_executable":146,"find_python_from_executable":147,"else":148,"fatal_error":149,"please":150,"path":151,"desired":152,"before":153,"running":154,"configure":155,"endif":156,"update":157,"cmake_prefix_path":158,"append_cmake_prefix_path":159,"ensure":160,"nvcc":161,"command":162,"find_program":163,"nvcc_executable":164,"cuda_found":165,"found":166,"import":167,"configuration":168,"also":169,"imports":170,"partially":171,"hip":172,"some":173,"customizations":174,"need":175,"do":176,"explicitly":177,"check_language":178,"enable_language":179,"etc":180,"find_package":181,"required":182,"nvidia":183,"check":184,"must":185,"happen":186,"after":187,"because":188,"cmake_cuda_compiler_version":189,"gets":190,"defined":191,"version_greater_equal":192,"cuda_supported_archs":193,"forward":194,"non":195,"extensions":196,"external":197,"scripts":198,"strequal":199,"cpu":200,"cpu_extension":201,"return":202,"up":203,"language":204,"warn":205,"isn":206,"what":207,"hip_found":208,"vllm_gpu_lang":209,"torch_version":210,"version_equal":211,"saw":212,"instead":213,"elseif":214,"importing":215,"recognizes":216,"sets":217,"does":218,"let":219,"recognize":220,"get":221,"understand":222,"extension":223,"automatically":224,"enabled":225,"rocm_version_dev_major":226,"greater_equal":227,"we":228,"able":229,"control":230,"compile":231,"per":232,"file":233,"basis":234,"cut":235,"down":236,"time":237,"here":238,"extract":239,"remove":240,"cmake_cuda_flags":241,"applied":242,"globally":243,"clear_cuda_arches":244,"cuda_arch_flags":245,"extract_unique_cuda_archs_ascending":246,"cuda_archs":247,"filter":248,"archs":249,"since":250,"all":251,"cuda_archs_loose_intersection":252,"other":253,"targets":254,"override":255,"detected":256,"them":257,"current":258,"final":259,"arches":260,"stored":261,"vllm_gpu_arches":262,"override_gpu_arches":263,"_supported_archs":264,"query":265,"additional":266,"compilation":267,"flags":268,"given":269,"vllm_gpu_flags":270,"get_torch_gpu_compiler_flags":271,"parallelism":272,"nvcc_threads":273,"list":274,"append":275,"threads":276,"use":277,"fetchcontent":278,"compiled":279,"part":280,"process":281,"fetchcontent_base_dir":282,"play":283,"icely":284,"sccache":285,"each":286,"dependency":287,"produces":288,"artifacts":289,"its":290,"binary_dir":291,"avoid":292,"conflicts":293,"between":294,"types":295,"cmake_binary_dir":296,"make_directory":297,"directory":298,"exists":299,"base":300,"overriding":301,"adding":302,"ggdb3":303,"most":304,"verbose":305,"devug":306,"info":307,"cmake_":308,"_flags_debug":309,"o0":310,"cmake_cxx_flags_debug":311,"certain":312,"functions":313,"marked":314,"nodiscard":315,"yet":316,"ignores":317,"result":318,"generates":319,"lot":320,"always":321,"mask":322,"real":323,"issues":324,"suppressing":325,"until":326,"properly":327,"addressed":328,"_flags":329,"wno":330,"cmake_cxx_flags":331,"define":332,"cumem_allocator":333,"vllm_cumem_ext_src":334,"csrc":335,"cpp":336,"set_gencode_flags_for_srcs":337,"srcs":338,"enabling":339,"cumem":340,"allocator":341,"link":342,"against":343,"driver":344,"library":345,"cumem_libs":346,"cuda_driver":347,"define_gpu_extension_target":348,"destination":349,"sources":350,"libraries":351,"use_sabi":352,"with_soabi":353,"vllm_ext_src":354,"mamba":355,"mamba_ssm":356,"selective_scan_fwd":357,"cu":358,"cache_kernels":359,"attention":360,"paged_attention_v1":361,"paged_attention_v2":362,"merge_attn_states":363,"vertical_slash_index":364,"pos_encoding_kernels":365,"cs":366,"rc":367,"activation_kernels":368,"layernorm_kernels":369,"layernorm_quant_kernels":370,"sampler":371,"cuda_view":372,"quantization":373,"gptq":374,"q_gemm":375,"compressed_tensors":376,"int8_quant_kernels":377,"fp8":378,"common":379,"fused_kernels":380,"fused_layernorm_dynamic_per_token_quant":381,"gguf":382,"gguf_kernel":383,"cuda_utils_kernels":384,"custom_all_reduce":385,"torch_bindings":386,"cutlass_enable_headers_only":387,"bool":388,"enable":389,"header":390,"cutlass_revision":391,"fixes":392,"bogus":393,"messages":394,"v4":395,"revision":396,"source":397,"vllm_cutlass_src_dir":398,"provided":399,"env":400,"is_absolute":401,"get_filename_component":402,"absolute":403,"fetchcontent_declare":404,"source_dir":405,"git_repository":406,"github":407,"com":408,"git":409,"keep":410,"line":411,"above":412,"git_tag":413,"git_progress":414,"speed":415,"download":416,"retrieving":417,"history":418,"important":419,"git_shallow":420,"works":421,"branch":422,"names":423,"tags":424,"updated":425,"commit":426,"hash":427,"false":428,"git_sha":429,"llow":430,"fetchcontent_makeavailable":431,"awq":432,"gemm_kernels":433,"permute_cols":434,"cutlass_w8a8":435,"scaled_mm_entry":436,"fp4":437,"nvfp4_quant_entry":438,"nvfp4_scaled_mm_entry":439,"nvfp4_blockwise_moe_kernel":440,"sparse":441,"sparse_scaled_mm_entry":442,"cutlass_extensions":443,"mla":444,"cutlass_mla_entry":445,"per_token_group_quant":446,"marlin":447,"kernels":448,"least":449,"compatible":450,"group":451,"sizes":452,"shapes":453,"machete":454,"bf16":455,"atomicadd":456,"ptx":457,"marlin_archs":458,"generate":459,"preselected":460,"input":461,"pairs":462,"schedules":463,"marlin_gen_script":464,"cmake_current_source_dir":465,"gptq_marlin":466,"generate_kernels":467,"md5":468,"marlin_gen_script_hash":469,"generation":470,"script":471,"last":472,"execute_process":473,"cmake_command":474,"pythonpath":475,"python_executable":476,"result_variable":477,"marlin_generation_result":478,"output_variable":479,"output_file":480,"cmake_current_binary_dir":481,"marlin_generation":482,"log":483,"error_file":484,"equal":485,"failed":486,"ncheck":487,"details":488,"force":489,"completed":490,"successfully":491,"has":492,"changed":493,"skipping":494,"glob":495,"marlin_template_kernel_src":496,"kernel_":497,"set_source_files_properties":498,"properties":499,"compile_flags":500,"static":501,"global":502,"template":503,"stub":504,"marlin_srcs":505,"dense":506,"marlin_cuda_kernel":507,"marlin_24_cuda_kernel":508,"qqq":509,"marlin_qqq_gemm_kernel":510,"gptq_marlin_repack":511,"awq_marlin_repack":512,"allspark":513,"allspark_archs":514,"allspark_srcs":515,"gptq_allspark":516,"allspark_repack":517,"allspark_qgemm_w8a16":518,"scaled_mm_3x_archs":519,"cutlass_scaled_mm":520,"hopper":521,"c3x":522,"require":523,"later":524,"scaled_mm_archs":525,"0a":526,"scaled_mm_c3x_sm90":527,"scaled_mm_sm90_fp8":528,"scaled_mm_sm90_int8":529,"lass_w8a8":530,"scaled_mm_azp_sm90_int8":531,"scaled_mm_blockwise_sm90_fp8":532,"denable_scaled_mm_sm90":533,"scaled_mm_c2x":534,"know":535,"doesn":536,"compiler":537,"recommend":538,"upgrading":539,"intend":540,"quantized":541,"models":542,"geforce":543,"blackwell":544,"sm120":545,"scaled_mm_c3x_sm120":546,"scaled_mm_sm120_fp8":547,"scaled_mm_blockwise_sm120_fp8":548,"set_genco":549,"de_flags_for_srcs":550,"denable_scaled_mm_sm120":551,"scaled_mm_c3x_120":552,"sm100":553,"1a":554,"scaled_mm_c3x_sm100":555,"scaled_mm_sm100_fp8":556,"scaled_mm_blockwise_sm100_fp8":557,"set_gencode":558,"_flags_for_srcs":559,"denable_scaled_mm_sm100":560,"scaled_mm_c3x_100":561,"c2x":562,"remaining":563,"already":564,"built":565,"3x":566,"scaled_mm_2x_archs":567,"subtract":568,"out":569,"remove_item":570,"set_gencode_flags_for_sr":571,"denable_scaled_mm_c2x":572,"covered":573,"scaled_mm_c3x":574,"cutlass_scaled_sparse_mm":575,"cutlass_compressor":576,"work":577,"sparse_scaled_mm_c3x":578,"_gpu_flags":579,"denable_sparse_scaled_mm_c3x":580,"nvfp4_scaled_mm_sm120":581,"fp4_archs":582,"nvfp4_quant_kernels":583,"nvfp4_scaled_mm_sm120_kernels":584,"denable_nvfp4_sm120":585,"nvfp4":586,"were":587,"clear":588,"nvfp4_experts_quant":589,"nvfp4_scaled_mm_kernels":590,"sr":591,"denable_nvfp4_sm100":592,"denable_cutlass_moe_sm100":593,"mla_archs":594,"cutlass_mla_kernels":595,"sm100_cutlass_mla_kernel":596,"denable_cutlass_mla":597,"add":598,"specific":599,"directories":600,"include_directories":601,"cutlass_dir":602,"examples":603,"77_blackwell_fmha":604,"moe":605,"kernel":606,"cutlass_moe_mm":607,"requires":608,"get_cutlass_":609,"pplx_":610,"moe_mm_data":611,"possible":612,"output":613,"grouped_mm_c3x_sm90":614,"scale":615,"d_mm_archs":616,"denable_cutlass_moe_sm90":617,"grouped_mm_c3x":618,"grouped_mm_c3x_sm100":619,"cmake_cuda_compil":620,"er_version":621,"moe_data":622,"cutlass_moe_data_archs":623,"cmake_cud":624,"a_compiler_version":625,"blockwise_scaled_group_mm_sm100":626,"el":627,"se":628,"something":629,"sm90a":630,"machete_archs":631,"machete_gen_script":632,"machete_gen_script_hash":633,"machete_generation_result":634,"machete_generation_output":635,"mache":636,"te_generation":637,"machete_generation":638,"generated":639,"machete_gen_sources":640,"machete_pytorch":641,"w4a16":642,"quickreduce":643,"ke":644,"rnels":645,"custom_quickreduce":646,"cutlass_include_dir":647,"cutlass_tools_util_include_dir":648,"uses":649,"cudagetdriverentrypointbyversion":650,"wrapper":651,"calling":652,"api":653,"causes":654,"problems":655,"linking":656,"earlier":657,"setting":658,"variable":659,"sidesteps":660,"issue":661,"target_compile_definitions":662,"private":663,"cutlass_enable_direct_cuda_driver_call":664,"_moe_c":665,"vllm_moe_ext_src":666,"moe_align_sum_kernels":667,"topk_softmax_kernels":668,"moe_wna16":669,"moe_permute_src":670,"permute_unpermute_kernels":671,"moe_permute_unpermute_kernel":672,"moe_permute_unpermute_op":673,"vllm_moe_wna16_src":674,"marlin_moe_archs":675,"gene":676,"rate":677,"moe_marlin_gen_script":678,"marlin_moe_wna16":679,"moe_marlin_gen_script_hash":680,"moe_marlin_generation_result":681,"moe_marlin_generation_output":682,"moe_marlin_generation":683,"moe_wnaa16_marlin_src":684,"architectur":685,"security":686,"policy":687,"reporting":688,"report":689,"privately":690,"vulnerability":691,"submission":692,"form":693,"advisories":694,"new":695,"triage":696,"reports":697,"triaged":698,"management":699,"team":700,"vulnerability_management":701,"html":702,"threat":703,"model":704,"see":705,"guide":706,"documentation":707,"usage":708,"more":709,"assumptions":710,"recommendations":711,"blob":712,"main":713,"md":714,"how":715,"securely":716,"interact":717,"severity":718,"determine":719,"risk":720,"taking":721,"account":722,"our":723,"experience":724,"dealing":725,"past":726,"affected":727,"defaults":728,"cases":729,"following":730,"categories":731,"critical":732,"vulnerabilities":733,"allow":734,"remote":735,"attackers":736,"execute":737,"arbitrary":738,"take":739,"full":740,"system":741,"significantly":742,"compromise":743,"confidentiality":744,"integrity":745,"availability":746,"without":747,"any":748,"interaction":749,"privileges":750,"needed":751,"execution":752,"via":753,"network":754,"deserialization":755,"allo":756,"markdownlint":757,"disable":758,"md001":759,"md041":760,"align":761,"center":762,"picture":763,"media":764,"prefers":765,"color":766,"scheme":767,"dark":768,"srcset":769,"raw":770,"githubusercontent":771,"assets":772,"logos":773,"logo":774,"text":775,"png":776,"img":777,"alt":778,"src":779,"light":780,"width":781,"55":782,"h3":783,"easy":784,"fast":785,"cheap":786,"llm":787,"serving":788,"everyone":789,"href":790,"blog":791,"arxiv":792,"org":793,"abs":794,"2309":795,"06180":796,"paper":797,"vllm_project":798,"twitter":799,"discuss":800,"user":801,"forum":802,"slack":803,"developer":804,"news":805,"2025":806,"08":807,"hosted":808,"beijing":809,"meetup":810,"mp":811,"weixin":812,"qq":813,"dgkwg1wfpwgo2jcdtqqhxa":814,"focusing":815,"large":816,"deployment":817,"slides":818,"drive":819,"google":820,"folders":821,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":822,"recording":823,"www":824,"chaspark":825,"live":826,"1166916873711665152":827,"05":828,"nyc":829,"lu":830,"ma":831,"c1rqyf1f":832,"presentation":833,"1_q_aw_iomjwuimf1s1ym":834,"zhjxz8cuel0ijvaquoybea":835,"edit":836,"usp":837,"sharing":838,"now":839,"under":840,"foundation":841,"announcement":842,"welcomes":843,"01":844,"excited":845,"announce":846,"alpha":847,"release":848,"v1":849,"major":850,"architectural":851,"upgrade":852,"7x":853,"speedup":854,"clean":855,"optimized":856,"loop":857,"zero":858,"overhead":859,"prefix":860,"caching":861,"enhanced":862,"multimodal":863,"support":864,"post":865,"27":866,"summary":867,"previous":868,"04":869,"asia":870,"day":871,"sginnovate":872,"event":873,"limited":874,"morning":875,"evening":876,"slots":877,"inaugural":878,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":879,"03":880,"ollama":881,"inference":882,"night":883,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":884,"china":885,"n77gibl2coratqhtveazfg":886,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":887,"east":888,"coast":889,"7mu4k4xx":890,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":891,"slide":892,"id":893,"g31441846c39_0_0":894,"02":895,"ninth":896,"h7g3kuj9":897,"meta":898,"1jzc_pzvxrvnsfvcw":899,"v4cfxb6pn7zz2cyp_flwo05aqg":900,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":901,"view":902,"posted":903,"eighth":904,"zep56hui":905,"cloud":906,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":907,"1h24phewanyrl11xy5dxubvrc9f9kkjix":908,"2024":909,"joins":910,"ecosystem":911,"everyon":912,"seventh":913,"h0qvrajz":914,"snowflake":915,"1e3cxqbv3jsfgp30swyvs3em_tw":916,"ghohj9pajgk6kr54":917,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":918,"have":919,"just":920,"created":921,"coordinating":922,"contributions":923,"discussing":924,"features":925,"feel":926,"free":927,"join":928,"us":929,"ray":930,"summit":931,"held":932,"special":933,"track":934,"opening":935,"talk":936,"1b_kqxphbtra_mdf":937,"tr6i8rwdou5qotznceg2mkzxehm":938,"learn":939,"talks":940,"youtube":941,"playlist":942,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":943,"contributors":944,"users":945,"09":946,"sixth":947,"87q3nvnh":948,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":949,"9wqyp7ny93xrs":950,"07":951,"fifth":952,"lp0gyjqr":953,"aws":954,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":955,"partnership":956,"officially":957,"supports":958,"llama":959,"pipeline":960,"23":961,"llama31":962,"06":963,"fourth":964,"agivllm":965,"cloudflare":966,"bentoml":967,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":968,"third":969,"robloxandvllmmeetup2024":970,"splashthat":971,"roblox":972,"sl":973,"ides":974,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":975,"second":976,"ygxbpzhl":977,"ibm":978,"12mi2skabnuw5rbwxdyy":979,"hthth4imsnceoq10jdqbxga":980,"2023":981,"a16z":982,"1ql":983,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":984,"would":985,"like":986,"express":987,"sincere":988,"gratitude":989,"andreessen":990,"horowitz":991,"30":992,"supporting":993,"open":994,"community":995,"providing":996,"generous":997,"grant":998,"development":999,"research":1000,"released":1001,"fastchat":1002,"integration":1003,"powered":1004,"lmsys":1005,"vicuna":1006,"chatbot":1007,"arena":1008,"chat":1009,"mid":1010,"april":1011,"originally":1012,"developed":1013,"sky":1014,"computing":1015,"lab":1016,"berkeley":1017,"edu":1018,"uc":1019,"evolved":1020,"driven":1021,"both":1022,"academia":1023,"industry":1024,"state":1025,"art":1026,"throughput":1027,"efficient":1028,"key":1029,"value":1030,"memory":1031,"pagedattention":1032,"20":1033,"continuous":1034,"batching":1035,"incoming":1036,"requests":1037,"graph":1038,"quantizations":1039,"2210":1040,"17323":1041,"2306":1042,"00978":1043,"autoround":1044,"05516":1045,"int4":1046,"int8":1047,"including":1048,"flashattention":1049,"flashinfer":1050,"speculative":1051,"decoding":1052,"chunked":1053,"prefill":1054,"flexible":1055,"seamless":1056,"popular":1057,"hugging":1058,"face":1059,"high":1060,"algorithms":1061,"parallel":1062,"sampling":1063,"beam":1064,"search":1065,"tensor":1066,"data":1067,"expert":1068,"distributed":1069,"streaming":1070,"outputs":1071,"openai":1072,"server":1073,"gpus":1074,"cpus":1075,"intel":1076,"powerpc":1077,"tpu":1078,"neuron":1079,"multi":1080,"lora":1081,"seamlessly":1082,"huggingface":1083,"transformer":1084,"llms":1085,"mixture":1086,"mixtral":1087,"deepseek":1088,"v2":1089,"v3":1090,"embedding":1091,"e5":1092,"mistral":1093,"modal":1094,"llava":1095,"supported_models":1096,"getting":1097,"started":1098,"pip":1099,"getting_started":1100,"index":1101,"wheel":1102,"bash":1103,"visit":1104,"quickstart":1105,"welcome":1106,"collaborations":1107,"involved":1108,"sponsors":1109,"compute":1110,"resources":1111,"testing":1112,"organizations":1113,"thank":1114,"your":1115,"sort":1116,"alphabetical":1117,"cash":1118,"donations":1119,"dropbox":1120,"sequoia":1121,"capital":1122,"skywork":1123,"zhenfund":1124,"alibaba":1125,"anyscale":1126,"crusoe":1127,"databricks":1128,"ctypes":1129,"importlib":1130,"util":1131,"json":1132,"logging":1133,"os":1134,"re":1135,"shutil":1136,"subprocess":1137,"sys":1138,"pathlib":1139,"packaging":1140,"parse":1141,"setuptools":1142,"build_ext":1143,"setuptools_scm":1144,"get_version":1145,"cpp_extension":1146,"cuda_home":1147,"rocm_home":1148,"def":1149,"load_module_from_path":1150,"module_name":1151,"spec":1152,"spec_from_file_location":1153,"module":1154,"module_from_spec":1155,"modules":1156,"loader":1157,"exec_module":1158,"root_dir":1159,"__file__":1160,"parent":1161,"logger":1162,"getlogger":1163,"__name__":1164,"cannot":1165,"envs":1166,"depends":1167,"installed":1168,"platform":1169,"startswith":1170,"darwin":1171,"due":1172,"macos":1173,"elif":1174,"linux":1175,"wsl":1176,"correctly":1177,"empty":1178,"none":1179,"getenv":1180,"available":1181,"fallback":1182,"main_cuda_version":1183,"is_sccache_available":1184,"int":1185,"vllm_disable_sccache":1186,"is_ccache_available":1187,"ccache":1188,"is_ninja_available":1189,"is_url_available":1190,"url":1191,"str":1192,"urllib":1193,"request":1194,"urlopen":1195,"except":1196,"exception":1197,"200":1198,"class":1199,"cmakeextension":1200,"__init__":1201,"self":1202,"name":1203,"cmake_lists_dir":1204,"kwa":1205,"super":1206,"py_limited_api":1207,"abspath":1208,"cmake_build_ext":1209,"dict":1210,"been":1211,"configured":1212,"did_config":1213,"number":1214,"jobs":1215,"optionally":1216,"compute_num_jobs":1217,"num_jobs":1218,"either":1219,"max_jobs":1220,"environment":1221,"sched_getaffinity":1222,"universally":1223,"fall":1224,"back":1225,"cpu_count":1226,"len":1227,"attributeerror":1228,"_is_cuda":1229,"get_nvcc_cuda_version":1230,"reduce":1231,"overloading":1232,"max":1233,"perform":1234,"single":1235,"ext":1236,"ve":1237,"cmakelists":1238,"exit":1239,"early":1240,"select":1241,"optimization":1242,"level":1243,"debug":1244,"default_cfg":1245,"relwithdebinfo":1246,"cfg":1247,"cmake_args":1248,"dcmake_build_type":1249,"format":1250,"dcmake_verbose_makefile":1251,"dcmake_c_compiler_launcher":1252,"dcmake_cxx_compiler_launcher":1253,"dcmake_cuda_compiler_launcher":1254,"dcmake_hip_compiler_launcher":1255,"pass":1256,"exact":1257,"reuse":1258,"subsequent":1259,"calls":1260,"dvllm_python_path":1261,"downloads":1262,"root":1263,"deps":1264,"allows":1265,"profiles":1266,"plays":1267,"nicely":1268,"fc_base_dir":1269,"environ":1270,"dfetchcontent_base_dir":1271,"tool":1272,"precompiled_build_ext":1273,"disables":1274,"precompiled":1275,"binaries":1276,"assert":1277,"vllm_use_precompiled":1278,"builds":1279,"build_extensions":1280,"print":1281,"precompiled_wheel_utils":1282,"extracts":1283,"existing":1284,"staticmethod":1285,"extract_precompiled_and_patch_package":1286,"wheel_url_or_path":1287,"tempfile":1288,"zipfile":1289,"temp_dir":1290,"isfile":1291,"wheel_filename":1292,"split":1293,"mkdtemp":1294,"wheels":1295,"wheel_path":1296,"downloading":1297,"urlretrieve":1298,"filename":1299,"package_data_patch":1300,"files_to_copy":1301,"abi3":1302,"_flashmla_c":1303,"vllm_flash_attn":1304,"_vllm_fa2_c":1305,"_vllm_fa3_c":1306,"compiled_regex":1307,"file_members":1308,"lambda":1309,"filelist":1310,"_no_device":1311,"has_cuda":1312,"_is_neuron":1313,"_is_tpu":1314,"_is_hip":1315,"_is_cpu":1316,"_is_xpu":1317,"xpu":1318,"_build_custom_ops":1319,"get_rocm_version":1320,"bin":1321,"librocm":1322,"core":1323,"d11f5c20d500f729c393680a01fa902ebf92094b":1324,"rocm_version":1325,"l21":1326,"librocm_core_file":1327,"lib":1328,"is_file":1329,"librocm_core":1330,"cdll":1331,"vererrors":1332,"c_uint32":1333,"get_rocm_core_version":1334,"getrocmversion":1335,"restype":1336,"argtypes":1337,"pointer":1338,"minor":1339,"patch":1340,"byref":1341,"get_neuronxcc_version":1342,"sysconfig":1343,"site_dir":1344,"get_paths":1345,"purelib":1346,"version_file":1347,"neuronxcc":1348,"executed":1349,"fp":1350,"content":1351,"read":1352,"regular":1353,"expression":1354,"__version__":1355,"raise":1356,"runtimeerror":1357,"could":1358,"adapted":1359,"apex":1360,"8b7a1ff183741dd8f9b87e7bafd04cfde99cea28":1361,"nvcc_output":1362,"check_output":1363,"universal_newlines":1364,"release_idx":1365,"nvcc_cuda_version":1366,"get_gaudi_sw_version":1367,"returns":1368,"console":1369,"printing":1370,"hl":1371,"smi":1372,"shell":1373,"capture_output":1374,"enable_console":1375,"returncode":1376,"stdout":1377,"replace":1378,"get_vllm_version":1379,"write_to":1380,"_version":1381,"sep":1382,"dev":1383,"might":1384,"contain":1385,"cuda_version":1386,"cuda_version_str":1387,"skip":1388,"tarball":1389,"pypi":1390,"sdist":1391,"argv":1392,"neuron_version":1393,"neuron_version_str":1394,"unknown":1395,"runtime":1396,"get_requirements":1397,"requirements_dir":1398,"_read_requirements":1399,"strip":1400,"resolved_requirements":1401,"cuda_major":1402,"cuda_minor":1403,"modified_requirements":1404,"req":1405,"flash":1406,"attn":1407,"continue":1408,"valueerror":1409,"unsupported":1410,"traceback":1411,"typing":1412,"callable":1413,"unittest":1414,"mock":1415,"find_cuda_init":1416,"fn":1417,"object":1418,"helper":1419,"function":1420,"initialization":1421,"errors":1422,"initializes":1423,"prints":1424,"stack":1425,"trace":1426,"happens":1427,"_lazy_init":1428,"nonlocal":1429,"extract_stack":1430,"initialized":1431,"format_list":1432,"_minor_":1433,"_patch_":1434,"backwards":1435,"bug":1436,"_post1_":1437,"_patch":1438,"1_":1439,"explicit":1440,"implicit":1441,"cadence":1442,"bi":1443,"weekly":1444,"days":1445,"same":1446,"year":1447,"future":1448,"dates":1449,"below":1450,"tentative":1451,"releases":1452,"optional":1453,"date":1454,"jan":1455,"feb":1456,"mar":1457,"apr":1458,"jun":1459,"jul":1460,"13":1461,"aug":1462,"14":1463,"15":1464,"16":1465,"17":1466,"oct":1467,"18":1468,"19":1469,"nov":1470,"21":1471,"dec":1472,"22":1473,"dedicated":1474,"_major_":1475,"performed":1476,"previously":1477,"reused":1478,"triggered":1479,"push":1480,"tag":1481,"vx":1482,"rc1":1483,"enables":1484,"test":1485,"multiple":1486,"rcs":1487,"trigger":1488,"notes":1489,"monitor":1490,"reverts":1491,"apply":1492,"cherry":1493,"pick":1494,"criteria":1495,"approach":1496,"finalizing":1497,"picks":1498,"allowed":1499,"land":1500,"pr":1501,"typically":1502,"sufficient":1503,"complete":1504,"thorough":1505,"round":1506,"stable":1507,"regression":1508,"address":1509,"functional":1510,"performance":1511,"recent":1512,"severe":1513,"silent":1514,"incorrectness":1515,"compatibility":1516,"crashes":1517,"deadlocks":1518,"leaks":1519,"introduced":1520,"improvements":1521,"changes":1522,"change":1523,"identifiers":1524,"ci":1525,"feature":1526,"prs":1527,"considered":1528,"merged":1529,"trunk":1530,"manual":1531,"validations":1532,"e2e":1533,"validation":1534,"end":1535,"regressions":1536,"benchmark":1537,"workflow":1538,"actions":1539,"workflows":1540,"yml":1541,"coverage":1542,"llama3":1543,"llama4":1544,"hardware":1545,"h100":1546,"mi300x":1547,"_note":1548,"based":1549,"availability_":1550,"access":1551,"write":1552,"repository":1553,"review":1554,"familiarize":1555,"yourself":1556,"configurations":1557,"tree":1558,"benchmarks":1559,"navigate":1560,"__future__":1561,"annotations":1562,"regex":1563,"forbidden_patterns":1564,"allowed_patterns":1565,"get_staged_python_files":1566,"diff":1567,"cached":1568,"am":1569,"endswith":1570,"calledprocesserror":1571,"is_forbidden_import":1572,"pattern":1573,"check_file":1574,"filepath":1575,"tuple":1576,"violations":1577,"encoding":1578,"utf":1579,"line_num":1580,"enumerate":1581,"oserror":1582,"unicodedecodeerror":1583,"total_violations":1584,"violation":1585,"noqa":1586,"e501":1587,"rget":1588,"represents":1589,"ninja_log":1590,"start":1591,"creates":1592,"passing":1593,"times":1594,"seconds":1595,"float":1596,"appended":1597,"owner":1598,"weighted_duration":1599,"duration":1600,"task":1601,"targ":1602,"getextension":1603,"extra_patterns":1604,"best":1605,"canonical":1606,"ultimately":1607,"goal":1608,"steps":1609,"fn_pattern":1610,"fnmatch":1611,"good":1612,"grouping":1613,"type_mappings":1614,"break":1615,"capture":1616,"two":1617,"present":1618,"javac":1619,"jar":1620,"distinguished":1621,"interface":1622,"ext1":1623,"splitext":1624,"ext2":1625,"preserve":1626,"pdb":1627,"dll":1628,"exe":1629,"pefile":1630,"grouped":1631,"together":1632,"don":1633,"cause":1634,"listed":1635,"toc":1636,"attempt":1637,"identify":1638,"identifying":1639,"obj":1640,"categorized":1641,"mojo":1642,"jars":1643,"java":1644,"normalize":1645,"related":1646,"count":1647,"mojom":1648,"summarizeentries":1649,"entries":1650,"extra_step_types":1651,"passed":1652,"objects":1653,"create":1654,"stamp":1655,"beginning":1656,"ending":1657,"starting":1658,"stopping":1659,"iterate":1660,"through":1661,"keeping":1662,"tasks":1663,"calculate":1664,"total":1665,"weighted":1666,"ends":1667,"own":1668,"easily":1669,"calculated":1670,"task_start_stop_times":1671,"earliest":1672,"total_cpu_time":1673,"stop":1674,"length":1675,"weighted_total":1676,"flash_attn_c":1677,"elapsed":1678,"longest":1679,"machete_mm_":1680,"183":1681,"185":1682,"186":1683,"37":1684,"449":1685,"43":1686,"527":1687,"344":1688,"attention_":1689,"1087":1690,"log_file":1691,"parser":1692,"argparse":1693,"argumentparser":1694,"add_argument":1695,"dest":1696,"build_directory":1697,"help":1698,"semicolon":1699,"separated":1700,"patterns":1701,"analyze":1702,"args":1703,"_extra_args":1704,"parse_known_args":1705,"step_types":1706,"room":1707,"extra":1708,"long_ext_count":1709,"readtargets":1710,"errno":1711,"enoent":1712,"_is_internal":1713,"_fail":1714,"iterable":1715,"disallowed":1716,"eager":1717,"stderr":1718,"lineno":1719,"msg":1720,"spdx":1721,"license":1722,"identifier":1723,"apache":1724,"filecopyrighttext":1725,"copyright":1726,"lazy":1727,"loading":1728,"appears":1729,"within":1730,"type_checking":1731,"guard":1732,"short":1733,"whitelist":1734,"ast":1735,"collections":1736,"abc":1737,"repo_root":1738,"resolve":1739,"init_path":1740,"items":1741,"allowed_imports":1742,"frozenset":1743,"env_override":1744,"allowed_from_modules":1745,"read_text":1746,"visitor":1747,"nodevisitor":1748,"_in_type_checking":1749,"get_attr_docs":1750,"cls_node":1751,"classdef":1752,"docstrings":1753,"placed":1754,"attribute":1755,"assignments":1756,"body":1757,"davidism":1758,"mit":1759,"pairwise":1760,"implement":1761,"itertools":1762,"removed":1763,"dropped":1764,"iterator":1765,"iter":1766,"next":1767,"yield":1768,"consider":1769,"pair":1770,"nodes":1771,"assignment":1772,"constant":1773,"isinstance":1774,"assign":1775,"annassign":1776,"expr":1777,"doc":1778,"inspect":1779,"cleandoc":1780,"annotated":1781,"assigning":1782,"plain":1783,"configvalidator":1784,"visit_classdef":1785,"node":1786,"validate":1787,"config":1788,"dataclass":1789,"decorators":1790,"decorator_list":1791,"call":1792,"func":1793,"validate_class":1794,"fail":1795,"decorator":1796,"generic_visit":1797,"ensures":1798,"fields":1799,"values":1800,"field":1801,"docstring":1802,"validate_ast":1803,"stmt":1804,"validate_file":1805,"file_path":1806,"validating":1807,"dataclasses":1808,"systemexit":1809,"is_allowed_file":1810,"current_file":1811,"allowed_files":1812,"stripped":1813,"forbidden_import_re":1814,"allowed_lines":1815,"parse_diff":1816,"current_lineno":1817,"skip_allowed_file":1818,"splitlines":1819,"code_line":1820,"get_diff":1821,"diff_type":1822,"staged":1823,"unified":1824,"unstaged":1825,"all_violations":1826,"diff_output":1827,"extend":1828,"forbidden":1829,"direct":1830,"triton":1831,"triton_utils":1832,"get_python_executable":1833,"get_cpu_cores":1834,"cores":1835,"multiprocessing":1836,"generate_presets":1837,"output_path":1838,"cmakeuserpresets":1839,"attempting":1840,"detect":1841,"nvcc_path":1842,"prospective_path":1843,"nvcc_path_input":1844,"provide":1845,"usr":1846,"local":1847,"python_executable_prompt":1848,"virtual":1849,"home":1850,"venvs":1851,"cpu_cores":1852,"min":1853,"cmake_jobs":1854,"launcher":1855,"cache_variables":1856,"_compiler_launcher":1857,"configure_preset":1858,"binarydir":1859,"sourcedir":1860,"cachevariables":1861,"generator":1862,"cmake_job_pools":1863,"slower":1864,"presets":1865,"cmakeminimumrequired":1866,"configurepresets":1867,"buildpresets":1868,"configurepreset":1869,"output_file_path":1870,"project_root":1871,"overwrite":1872,"lower":1873,"cancelled":1874,"dump":1875,"indent":1876,"nto":1877,"preset":1878,"is_python_file":1879,"scan_file":1880,"pickle_re":1881,"load_gitignore":1882,"gitignore_path":1883,"gitignore":1884,"ignore":1885,"pathspec":1886,"from_lines":1887,"gitwildmatch":1888,"dirname":1889,"bad_files":1890,"dirpath":1891,"filenames":1892,"walk":1893,"abs_path":1894,"rel_path":1895,"relpath":1896,"ignored":1897,"match_file":1898,"nerror":1899,"pickle":1900,"cloudpickle":1901,"nif":1902,"intentional":1903,"tools":1904,"check_pickle_imports":1905,"test_regex":1906,"test_cases":1907,"pkl":1908,"cpkl":1909,"dumps":1910,"loads":1911,"timport":1912,"somethingelse":1913,"pickleas":1914,"asdf":1915,"should_match":1916,"case":1917,"got":1918,"tests":1919,"spdxstatus":1920,"enum":1921,"enumeration":1922,"missing_license":1923,"missing_copyright":1924,"missing_both":1925,"full_spdx_header":1926,"license_line":1927,"copyright_line":1928,"check_spdx_header_status":1929,"lines":1930,"readlines":1931,"shebang":1932,"start_idx":1933,"has_license":1934,"has_copyright":1935,"headers":1936,"range":1937,"completely":1938,"missing":1939,"add_header":1940,"supplement":1941,"seek":1942,"truncate":1943,"writelines":1944,"insert":1945,"files_missing_both":1946,"files_missing_copyright":1947,"files_missing_license":1948,"collect":1949,"fixing":1950,"all_files_to_fix":1951,"largest_dist_from_leaf":1952,"depth":1953,"children":1954,"child":1955,"get_entries_at_depth":1956,"entries_and_traces":1957,"curr_depth":1958,"tall":1959,"enough":1960,"entry":1961,"fold_nodes":1962,"nodes_to_fold":1963,"while":1964,"pop":1965,"trim_string_back":1966,"offset":1967,"shorten_plot_legend_strings":1968,"legend":1969,"max_char_len":1970,"get_texts":1971,"set_text":1972,"abbreviate_known_names":1973,"get_text":1974,"abbreviations":1975,"mergedcolumnparallellinear":1976,"mcplinear":1977,"qkvparallellinear":1978,"qkvplinear":1979,"rowparallellinear":1980,"rplinear":1981,"weight":1982,"bfloat16":1983,"float16":1984,"f16":1985,"attempt_to_make_names_unique":1986,"non_unique_names":1987,"all_the_same":1988,"entries_and_traces_with_name":1989,"zipped_traces":1990,"zip":1991,"first_trace_difference":1992,"trace_eles":1993,"unique":1994,"leave":1995,"aggregated":1996,"pivot_table":1997,"operations":1998,"dataframe":1999,"ops":2000,"gemms":2001,"rms_norm":2002,"mem_ops":2003,"elementwise_ops":2004,"is_elementwise_op":2005,"nccl_all_reduce_ops":2006,"is_nccl_all_reduce":2007,"nccl_gather_ops":2008,"is_nccl_gather":2009,"nccl_broadcast_ops":2010,"is_nccl_broadcast":2011,"nccl_other_ops":2012,"is_nccl_op":2013,"cross_device_reduce_1stage_ops":2014,"is_cross_device_reduce_1stage":2015,"cross_device_reduce_2stage_ops":2016,"is_cross_device_reduce_2stage":2017,"custom_ar_all_reduce_ops":2018,"is_custom_ar_all_reduce":2019,"reduce_kernel_ops":2020,"is_reduce_kernel":2021,"attention_ops":2022,"trace_df":2023,"agg":2024,"sum":2025,"axis":2026,"quant_ops":2027,"sgmv_shrink_ops":2028,"sgmv_expand_ops":2029,"bg":2030,"mv_shrink_ops":2031,"bgmv_shrink_ops":2032,"bgmv_expand_ops":2033,"cutlass_gemm_ops":2034,"gemm_ops":2035,"rms_norm_ops":2036,"vocab_embed_ops":2037,"drop":2038,"inplace":2039,"um":2040,"flatten_entries":2041,"entry_cls":2042,"profile_dict":2043,"entries_and_depth":2044,"get_entries":2045,"om_ar":2046,"_norm_":2047,"norm":2048,"act_and_mul_":2049,"silu":2050,"rotary_embedding_kernel":2051,"rope":2052,"softmax":2053,"elementwise":2054,"fp8_quant":2055,"quantize":2056,"reduce_kernel":2057,"triton_kernel":2058,"mem":2059,"h_d_memops":2060,"misc":2061,"ds":2062,"layer_anno":2063,"stage":2064,"layer":2065,"substage":2066,"block_fp8":2067,"gemm_fp8_blockwise":2068,"block_fp8_gemm":2069,"fused_moe_kernel":2070,"_group_gemm":2071,"groupproblemshape":2072,"gemmuniversal":2073,"moe_gemm":2074,"gemm":2075,"matmul":2076,"nvjet":2077,"sigmoid":2078,"_fwd_":2079,"flashattn":2080,"_mla_":2081,"_attn_":2082,"catarraybatched":2083,"prepare_next":2084,"nccldevkernel":2085,"cross_device_reduce":2086,"nccl_and_custom_ar":2087,"sbtopk":2088,"topk":2089,"activation":2090,"compute_position_kernel":2091,"quant_fp8":2092,"cvt_fp16_to_fp4":2093,"gpt":2094,"oss":2095,"bmm_":2096,"section":2097,"triton_moe_gemm":2098,"matmul_ogs_":2099,"_topk_forward":2100,"_combined_routing":2101,"_sum_bitmatrix_rows":2102,"_compute_writeback_idx":2103,"columns":2104,"get_loc":2105,"ns":2106,"overlap":2107,"current_end":2108,"df":2109,"generating":2110,"make_html":2111,"output_dir":2112,"title":2113,"plotly":2114,"px":2115,"output_name":2116,"model_engine":2117,"sec":2118,"mapping":2119,"table":2120,"underscore":2121,"pd":2122,"categorical":2123,"sorted":2124,"instances":2125,"sort_values":2126,"to_csv":2127,"csv":2128,"histogram":2129,"text_auto":2130,"wrap":2131,"labels":2132,"update_xaxes":2133,"automargin":2134,"write_html":2135,"pivot_df":2136,"aggfunc":2137,"observed":2138,"row":2139,"bottom":2140,"loc":2141,"total_elapsed_sec":2142,"fillna":2143,"to_html":2144,"temp":2145,"outfile":2146,"infile":2147,"finished":2148,"bar":2149,"chart":2150,"anno_gpu_kernname":2151,"anno_gpu_kernname_helper":2152,"kern_name":2153,"val":2154,"make_nongpu_row":2155,"nongpu_sec":2156,"nongpu_row":2157,"iloc":2158,"instan":2159,"ces":2160,"is_valid_file":2161,"base_file":2162,"asserts":2163,"existent":2164,"getsize":2165,"exist":2166,"should_gen_file":2167,"new_file":2168,"figure":2169,"getmtime":2170,"reusing":2171,"gen_sum_file":2172,"nsys":2173,"file_dir":2174,"file_name":2175,"basename":2176,"overlapped":2177,"nsys_stats_file":2178,"_cuda_gpu_trace":2179,"sum_file":2180,"_cuda_gpu_kernel_tracesum":2181,"cmd":2182,"nsys_cmd":2183,"stats":2184,"cuda_gpu_trace":2185,"cmd_str":2186,"specify":2187,"overalapped":2188,"sum_":2189,"gen_nonoverlapped_sum_from_gputrace":2190,"gen_graph":2191,"in_file":2192,"out_dir":2193,"initialize":2194,"store":2195,"combined":2196,"combined_df":2197,"idx":2198,"engine":2199,"total_sec":2200,"read_csv":2201,"annotate":2202,"enginemodeldata":2203,"engine_model":2204,"rep":2205,"shorter":2206,"label":2207,"gpu_sec":2208,"2f":2209,"resetting":2210,"concat":2211,"ignore_index":2212,"parse_tuple":2213,"basicconfig":2214,"asctime":2215,"levelname":2216,"description":2217,"cycles":2218,"gputrc2graph":2219,"d1":2220,"100":2221,"d2":2222,"102":2223,"formatter_class":2224,"rawdescriptionhelpformatter":2225,"showing":2226,"combinations":2227,"engine_model_help":2228,"model_list":2229,"keys":2230,"engine_model_str":2231,"nargs":2232,"elapsed_nonprofiled_sec":2233,"space":2234,"profiling":2235,"inflate":2236,"dir":2237,"parse_args":2238,"gputrace":2239,"gputrace2graph":2240,"cluster":2241,"described":2242,"technical":2243,"http":2244,"2412":2245,"19437":2246,"way":2247,"deploy":2248,"many":2249,"experts":2250,"however":2251,"components":2252,"beyond":2253,"normal":2254,"impossible":2255,"bundle":2256,"pplx":2257,"ppl":2258,"deepep":2259,"necessary":2260,"nvshmem":2261,"privileged":2262,"ibgda":2263,"done":2264,"host":2265,"machine":2266,"accept":2267,"positional":2268,"argument":2269,"workspace":2270,"staging":2271,"defaulting":2272,"pwd":2273,"ep_kernels_workspace":2274,"torch_cuda_arch_list":2275,"install_python_libraries":2276,"sh":2277,"sudo":2278,"configure_system_drivers":2279,"reboot":2280,"load":2281,"vllm_max_size_mb":2282,"400":2283,"mib":2284,"quota":2285,"wisely":2286,"3792":2287,"print_top_10_largest_files":2288,"zip_file":2289,"top":2290,"largest":2291,"file_sizes":2292,"getinfo":2293,"file_size":2294,"namelist":2295,"reverse":2296,"size":2297,"1024":2298,"mbs":2299,"uncompressed":2300,"check_wheel_size":2301,"whl":2302,"wheel_size_mb":2303,"larger":2304,"mb":2305,"limit":2306,"launch_lm_eval":2307,"eval_config":2308,"tp_size":2309,"trust_remote_code":2310,"max_model_len":2311,"4096":2312,"model_args":2313,"pretrained":2314,"model_name":2315,"tensor_parallel_size":2316,"enforce_eager":2317,"add_bos_token":2318,"lm_eval":2319,"simple_evaluate":2320,"num_fewshot":2321,"batch_size":2322,"auto":2323,"test_lm_eval_correctness_param":2324,"config_filename":2325,"yaml":2326,"safe_load":2327,"success":2328,"metric":2329,"metrics":2330,"ground_truth":2331,"measured_value":2332,"measured":2333,"np":2334,"isclose":2335,"rtol":2336,"pytest":2337,"pytest_addoption":2338,"addoption":2339,"action":2340,"listing":2341,"yamls":2342,"tp":2343,"evaluation":2344,"config_list_file":2345,"pytestconfig":2346,"config_dir":2347,"getoption":2348,"pytest_generate_tests":2349,"metafunc":2350,"fixturenames":2351,"configs":2352,"parametrize":2353,"70b":2354,"instruct":2355,"fbgemm":2356,"nonuniform":2357,"8x7b":2358,"v0":2359,"qwen2":2360,"57b":2361,"a14":2362,"lite":2363,"8b":2364,"5b":2365,"1b":2366,"compressed":2367,"tensors":2368,"asym":2369,"vl":2370,"3b":2371,"dynamic":2372,"qwen1":2373,"nightly":2374,"annotation":2375,"contains":2376,"benchmarking":2377,"artifact":2378,"visualization":2379,"reproduction":2380,"inside":2381,"folder":2382,"export":2383,"hf_token":2384,"hf":2385,"token":2386,"apt":2387,"unzip":2388,"vllm_source_code_loc":2389,"buildkite":2390,"aims":2391,"clarity":2392,"tensorrt":2393,"lmdeploy":2394,"sglang":2395,"leads":2396,"suite":2397,"introduction":2398,"workload":2399,"developers":2400,"gain":2401,"whether":2402,"improves":2403,"degrades":2404,"compare":2405,"alternatives":2406,"tgi":2407,"trt":2408,"public":2409,"choose":2410,"dashboard":2411,"hud":2412,"reponame":2413,"2fvllm":2414,"readme":2415,"quick":2416,"overview":2417,"latency":2418,"fix":2419,"qps":2420,"a100":2421,"coming":2422,"xeon":2423,"processors":2424,"different":2425,"1hr":2426,"constraint":2427,"hr":2428,"won":2429,"forever":2430,"engines":2431,"5hrs":2432,"being":2433,"every":2434,"those":2435,"perf":2436,"ready":2437,"on_cpu":2438,"serving_json":2439,"latency_json":2440,"throughput_json":2441,"throughout":2442,"remote_host":2443,"ip":2444,"service":2445,"remote_port":2446,"port":2447,"descriptions":2448,"detailed":2449,"test_name":2450,"latency_llama8b_tp1":2451,"parameters":2452,"load_format":2453,"dummy":2454,"num_iters_warmup":2455,"num_iters":2456,"attributes":2457,"latency_":2458,"attri":2459,"bute":2460,"arguments":2461,"bench":2462,"underline":2463,"dash":2464,"specifying":2465,"convert":2466,"feeding":2467,"corresponding":2468,"num":2469,"iters":2470,"warmup":2471,"numbers":2472,"highly":2473,"sensitive":2474,"save":2475,"itself":2476,"parameter":2477,"syntax":2478,"similar":2479,"fed":2480,"slight":2481,"vary":2482,"serve":2483,"inf":2484,"cover":2485,"online":2486,"serving_llama8b_tp1_sharegpt":2487,"qps_list":2488,"server_parameters":2489,"eta":2490,"swap_space":2491,"disable_log_stats":2492,"client_parameters":2493,"dataset_name":2494,"sharegpt":2495,"dataset_path":2496,"sharegpt_v3_unfiltered_cleaned_split":2497,"num_prompts":2498,"serving_":2499,"includes":2500,"client":2501,"controls":2502,"less":2503,"compared":2504,"delay":2505,"randomized":2506,"dataset":2507,"benchmark_serving":2508,"still":2509,"greatly":2510,"saving":2511,"visualizing":2512,"markdown":2513,"helps":2514,"put":2515,"formatting":2516,"presented":2517,"job":2518,"page":2519,"wait":2520,"till":2521,"finish":2522,"attached":2523,"tab":2524,"converted":2525,"along":2526,"benchmark_results":2527,"compares":2528,"provides":2529,"ratio":2530,"tput":2531,"median":2532,"ttft":2533,"tpot":2534,"pp":2535,"result_a":2536,"result_b":2537,"lenght":2538,"concurrency":2539,"results_a":2540,"results_b":2541,"perf_ratio":2542,"random":2543,"128":2544,"1000":2545,"142":2546,"633982":2547,"156":2548,"526018":2549,"097396":2550,"241":2551,"620334":2552,"294":2553,"018783":2554,"216863":2555,"comparison":2556,"diagram":2557,"96c":2558,"results_gnr_96c_091_tp2pp3":2559,"128c":2560,"results_gnr_128c_091_tp2pp3":2561,"1886":2562,"height":2563,"828":2564,"image":2565,"attachments":2566,"c02a43ef":2567,"25d0":2568,"4fd6":2569,"90e5":2570,"2169a28682dd":2571,"containers":2572,"yam":2573,"32":2574,"tokens":2575,"batch":2576,"fixed":2577,"mean":2578,"p99":2579,"latency_tests_markdown_table":2580,"randomly":2581,"sample":2582,"prompts":2583,"seed":2584,"dynamically":2585,"determined":2586,"achieve":2587,"maximum":2588,"throughput_tests_markdo":2589,"numpy":2590,"pandas":2591,"tabulate":2592,"parse_arguments":2593,"where":2594,"get_perf":2595,"method":2596,"means":2597,"qps_":2598,"filtered_df":2599,"array":2600,"get_perf_w_std":2601,"itl":2602,"ms":2603,"tolist":2604,"std":2605,"successful":2606,"sqrt":2607,"tok":2608,"results_folder":2609,"test_file":2610,"_nightly_results":2611,"from_dict":2612,"md_table":2613,"tablefmt":2614,"pipe":2615,"showindex":2616,"nightly_results_benchmarking_table":2617,"nightly_results":2618,"bytes":2619,"proper":2620,"1253656":2621,"20mb":2622,"1253656678":2623,"17gb":2624,"factor":2625,"unit":2626,"suffix":2627,"_coerce":2628,"effort":2629,"coercion":2630,"low":2631,"null":2632,"integers":2633,"fullmatch":2634,"floats":2635,"nan":2636,"strings":2637,"parse_client_command":2638,"client_command":2639,"toks":2640,"shlex":2641,"rai":2642,"boolean":2643,"flag":2644,"metadata":2645,"consume":2646,"standard":2647,"lone":2648,"unexpected":2649,"__main__":2650,"filenotfounderror":2651,"raw_result":2652,"attach":2653,"with_suffix":2654,"commands":2655,"arg":2656,"server_command":2657,"dtype":2658,"col_mapping":2659,"pp_size":2660,"input_len":2661,"output_len":2662,"stem":2663,"serving_results":2664,"st":2665,"em":2666,"percentiles":2667,"perc":2668,"25":2669,"50":2670,"75":2671,"90":2672,"99":2673,"multiply":2674,"avg_latency":2675,"latency_results":2676,"throughput_results":2677,"svmem":2678,"psutil":2679,"virtual_memory":2680,"platform_data":2681,"physical":2682,"logical":2683,"get_size_with_unit":2684,"find_spec":2685,"numa":2686,"get_num_configured_nodes":2687,"cpuinfo":2688,"get_cpu_info":2689,"brand":2690,"brand_raw":2691,"platform_results":2692,"orient":2693,"raw_results_json":2694,"results_to_json":2695,"remapping":2696,"purpose":2697,"latency_column_mapping":2698,"rename":2699,"valid_columns":2700,"col":2701,"serving_column_mapping":2702,"throughput_results_column_mapping":2703,"processed_results_json":2704,"dataframes":2705,"respective":2706,"sometimes":2707,"come":2708,"gputype":2709,"ngputype":2710,"turn":2711,"8xgputype":2712,"tables":2713,"latency_md_table":2714,"serving_md_table":2715,"throughput_md":2716,"_table":2717,"platform_md_table":2718,"document":2719,"md_file":2720,"json_file":2721,"read_markdown":2722,"throughput_tests_markdown_table":2723,"throughput_md_table":2724,"serving_tests_markdown_table":2725,"platform_markdown_table":2726,"benchmarking_results_in_json_string":2727,"to_dict":2728,"records":2729,"cachedir":2730,"tokenizer":2731,"autotokenizer":2732,"from_pretrained":2733,"save_pretrained":2734,"saved":2735,"frames":2736,"serving_df":2737,"show":2738,"mode":2739,"name_column":2740,"_name":2741,"data_column":2742,"raw_data_cols":2743,"compare_frames":2744,"among":2745,"ratio_df":2746,"concat_df":2747,"split_json_by_tp_pp":2748,"input_file":2749,"output_root":2750,"separate":2751,"_pp":2752,"paths":2753,"written":2754,"handle":2755,"alias":2756,"column":2757,"rename_map":2758,"pipeline_parallel_size":2759,"numeric":2760,"ints":2761,"to_numeric":2762,"coerce":2763,"astype":2764,"saved_paths":2765,"group_df":2766,"groupby":2767,"dropna":2768,"folder_name":2769,"makedirs":2770,"exist_ok":2771,"to_json":2772,"force_ascii":2773,"store_true":2774,"debugging":2775,"plot":2776,"booleanoptionalaction":2777,"ain__":2778,"diagrams":2779,"xaxis":2780,"comparision":2781,"drop_column":2782,"info_cols":2783,"data_cols_to_compare":2784,"compare_data_columns":2785,"ncompare_data_column":2786,"data_df":2787,"read_json":2788,"subset":2789,"couple":2790,"output_r":2791,"oot":2792,"html_msgs_for_data_cols":2793,"splits":2794,"key_cache":2795,"value_cache":2796,"num_kv_heads":2797,"block_tables":2798,"seq_lens":2799,"block_size":2800,"max_seq_len":2801,"alibi_slopes":2802,"kv_cache_dtype":2803,"k_scale":2804,"v_scale":2805,"tp_rank":2806,"blocksparse_local_blocks":2807,"blocksparse_vert_stride":2808,"blocksparse_block_size":2809,"64":2810,"blocksparse_head_sliding_step":2811,"exp_sum":2812,"max_logits":2813,"tmp_out":2814,"paged_attention_rocm":2815,"query_start_loc":2816,"fp8_out_scale":2817,"_rocm_c":2818,"paged_attention":2819,"mla_decode_kvcache_cpu":2820,"kv_cache":2821,"_c_cpu":2822,"mla_decode_kvcache":2823,"prefix_output":2824,"prefix_lse":2825,"suffix_output":2826,"suffix_lse":2827,"output_lse":2828,"convert_vertical_slash_indexes":2829,"q_seqlens":2830,"kv_seqlens":2831,"vertical_indexes":2832,"n_heads":2833,"nnz_v":2834,"slash_indexes":2835,"nnz_s":2836,"context_size":2837,"block_size_m":2838,"block_size_n":2839,"causal":2840,"num_heads":2841,"nnz_slash":2842,"nnz_vertical":2843,"num_rows":2844,"block_count":2845,"zeros":2846,"block_offset":2847,"column_count":2848,"column_index":2849,"contextlib":2850,"union":2851,"init_logger":2852,"platforms":2853,"current_platform":2854,"scalar_type":2855,"scalartype":2856,"ini":2857,"rotary_embedding":2858,"positions":2859,"head_size":2860,"cos_sin_cache":2861,"is_neox":2862,"batched_rotary_embedding":2863,"rot_dim":2864,"cos_sin_cache_offsets":2865,"epsilon":2866,"todo":2867,"contiguous":2868,"input_contiguous":2869,"fused_add_rms_norm":2870,"residual":2871,"apply_repetition_penalties_torch":2872,"logits":2873,"prompt_mask":2874,"output_mask":2875,"repetition_penalties":2876,"unsqueeze":2877,"dim":2878,"repeat":2879,"prompt":2880,"otherwise":2881,"op":2882,"penalties":2883,"positive":2884,"divide":2885,"penalty":2886,"scaling":2887,"apply_repetition_penalties_cuda":2888,"apply_repetition_penalties_":2889,"apply_repetition_penalties":2890,"repetition":2891,"place":2892,"shape":2893,"num_seqs":2894,"vocab_size":2895,"indicating":2896,"appear":2897,"is_cuda":2898,"is_contiguous":2899,"rms_norm_dynamic_per_token_quant":2900,"quant_dtype":2901,"scale_ub":2902,"empty_like":2903,"scales":2904,"numel":2905,"float32":2906,"awq_dequantize":2907,"qweight":2908,"split_k_iters":2909,"thx":2910,"thy":2911,"vllm_use_triton_awq":2912,"model_executor":2913,"layers":2914,"awq_triton":2915,"awq_dequantize_triton":2916,"awq_gemm":2917,"qzeros":2918,"awq_gemm_triton":2919,"gptq_gemm":2920,"b_q_weight":2921,"b_gptq_qzeros":2922,"b_gptq_scales":2923,"b_g_idx":2924,"use_exllama":2925,"bit":2926,"hasattr":2927,"register_fake":2928,"_gptq_gemm_fake":2929,"gptq_shuffle":2930,"q_weight":2931,"q_perm":2932,"marlin_gemm":2933,"b_scales":2934,"size_m":2935,"size_n":2936,"size_k":2937,"gptq_marlin_24_gemm":2938,"b_meta":2939,"b_q_type":2940,"machete_mm":2941,"machete_mm_fake":2942,"b_q":2943,"returned":2944,"machete_prepack_b":2945,"b_type":2946,"out_type":2947,"b_group_scales":2948,"b_group_zeros":2949,"b_group_size":2950,"b_channel_scales":2951,"a_token_scales":2952,"schedule":2953,"machete_prepack_b_fake":2954,"a_type":2955,"group_scales_type":2956,"memory_format":2957,"contiguous_format":2958,"allspark_w8a16_gemm":2959,"_allspark_w8a16_gemm_fake":2960,"b_qweight":2961,"b_qzeros":2962,"symint":2963,"group_size":2964,"sm_count":2965,"sm_version":2966,"cublas_m_threshold":2967,"has_zp":2968,"n32k16_reorder":2969,"ggml_dequantize":2970,"_ggml_dequantize_fake":2971,"quant":2972,"cutlass_scaled_mm_supports_fp4":2973,"cuda_device_capability":2974,"cutlass_blockwise_scaled_grouped_mm":2975,"scales_a":2976,"scales_b":2977,"problem_sizes":2978,